/* Menu item and window title */
"NINE_BOX_VIEW" = "NineBoxView Pro";

/* Reference glyph section */
"REFERENCE_INPUT_PLACEHOLDER" = "Enter reference glyphs...";
"SAVE_REFERENCE_BUTTON" = "Save";
"SAVE_REFERENCE_TOOLTIP" = "Save to reference presets";

/* Theme toggle button */
"THEME_TOGGLE_LIGHT_TOOLTIP" = "Switch to dark mode";
"THEME_TOGGLE_DARK_TOOLTIP" = "Switch to light mode";

/* Reference panel toggle button */
"REFERENCE_PANEL_SHOW_TOOLTIP" = "Show Reference Panel";
"REFERENCE_PANEL_HIDE_TOOLTIP" = "Hide Reference Panel";

/* Reference window title */
"REFERENCE_PANEL_TITLE" = "Reference";

/* Locked window title */
"LOCKED_PANEL_TITLE" = "Locked";

/* Presets panel toggle button */
"PRESETS_TOGGLE_SHOW_TOOLTIP" = "Show Presets Panel";
"PRESETS_TOGGLE_HIDE_TOOLTIP" = "Hide Presets Panel";

/* Presets window title */
"PRESETS_WINDOW_TITLE" = "Presets";

/* Blur slider */
"BLUR_SLIDER_TOOLTIP" = "Blur intensity";

/* Glyph picker */
"GLYPH_PICKER_TITLE_LOCK" = "Select Lock Glyph";
"GLYPH_PICKER_TITLE_REFERENCE" = "Select Reference Glyphs";

/* Context menu (Reference text view) */
"CONTEXT_MENU_GLYPH_PICKER" = "Glyph Picker…";

/* Titlebar menu button */
"TITLEBAR_MENU_TOOLTIP" = "Menu";

/* Info menu */
"INFO_MENU_HELP" = "User Guide";
"INFO_MENU_WEBSITE" = "Website";
"INFO_MENU_FEEDBACK" = "Feedback…";
"INFO_MENU_CONTACT_US" = "Contact Us…";
"INFO_MENU_TESTIMONIAL" = "Share Your Experience…";
"INFO_MENU_PURCHASE" = "Purchase…";

/* Lock toggle button (main window toolbar) */
"LOCK_TOGGLE_ENABLED_TOOLTIP" = "Locked glyphs shown (Cmd to edit)";
"LOCK_TOGGLE_DISABLED_TOOLTIP" = "Locked glyphs hidden (Cmd to edit)";

/* Locked glyph panel */
"CLEAR_LOCKED_BUTTON" = "Clear";
"CLEAR_LOCKED_TOOLTIP" = "Clear all locked glyphs";
"SAVE_LOCKED_BUTTON" = "Save";
"SAVE_LOCKED_TOOLTIP" = "Save to locked presets";
"LOCKED_PANEL_TOGGLE_SHOW" = "Show Locked Panel";
"LOCKED_PANEL_TOGGLE_HIDE" = "Hide Locked Panel";

/* Reference input dialog */
"REFERENCE_INPUT_CANCEL" = "Cancel";

/* Drag hint */
"Open Grid in New Tab" = "Open Grid in New Tab";

/* Toolbar toggle button */
"TOOLBAR_TOGGLE_HIDE_TOOLTIP" = "Hide toolbar";
"TOOLBAR_TOGGLE_SHOW_TOOLTIP" = "Show toolbar";

/* License status */
"LICENSE_TRIAL_REMAINING" = "Trial: %ld days remaining";
"LICENSE_TRIAL_DAYS" = "%ld days remaining";
"LICENSE_ACTIVATED" = "Licensed to: %@";

/* License input dialog */
"LICENSE_INPUT_TITLE" = "Activate License";
"LICENSE_INPUT_CANCEL" = "Cancel";
"LICENSE_INPUT_BUY" = "Purchase…";
"LICENSE_INPUT_CONTACT" = "Support";

/* License drop zone */
"LICENSE_DROP_HINT" = "Drop .license file here";
"LICENSE_DROP_ACTIVE" = "Release to activate";

/* License error messages */
"LICENSE_ERROR_INVALID_KEY" = "Invalid license key.";
"LICENSE_ERROR_INVALID_EMAIL" = "Invalid email address.";
"LICENSE_ERROR_INVALID_FILE" = "Invalid license file.";
"LICENSE_ERROR_WRONG_PRODUCT" = "This license is not for NineBoxView.";
"LICENSE_ERROR_MISSING_FIELDS" = "License file is incomplete.";
"LICENSE_ERROR_REVOKED" = "This license key has been revoked.";
"LICENSE_VERIFYING" = "Verifying license...";

/* License activation success */
"LICENSE_ACTIVATION_SUCCESS_TITLE" = "License Activated";
"LICENSE_ACTIVATION_SUCCESS_OK" = "OK";

/* Trial expired screen */
"LICENSE_EXPIRED_WINDOW_TITLE" = "NineBoxView Pro";
"LICENSE_EXPIRED_TITLE" = "Trial Period Expired";
"LICENSE_EXPIRED_MESSAGE" = "Your 14-day trial has ended.\nPlease purchase a license to continue using NineBoxView Pro.";
"LICENSE_EXPIRED_PURCHASE" = "Purchase License";
"LICENSE_EXPIRED_ENTER_KEY" = "Enter License Key";
"LICENSE_EXPIRED_FREE_VERSION" = "Use Free Version";

/* Info menu */
"INFO_MENU_ENTER_LICENSE" = "Enter License…";

/* Welcome dialog */
"LICENSE_WELCOME_TITLE" = "Welcome to NineBoxView Pro";
"LICENSE_WELCOME_MESSAGE" = "Experience powerful 9-grid preview for better glyph design decisions.\n\nYour 14-day free trial starts when you click the button below.";
"LICENSE_WELCOME_START_TRIAL" = "Start 14-Day Trial";
"LICENSE_WELCOME_ENTER_KEY" = "Enter License Key";

/* Palette tabs */
"PALETTE_TAB_REFERENCE" = "Ref";
"PALETTE_TAB_LOCKED" = "Locked";

/* Palette context menu */
"PALETTE_MENU_PIN" = "Pin";
"PALETTE_MENU_UNPIN" = "Unpin";
"PALETTE_MENU_RENAME" = "Rename…";
"PALETTE_MENU_OVERWRITE" = "Replace with Current";
"PALETTE_MENU_DELETE" = "Delete";

/* Palette context menu - multi-selection */
"PALETTE_MENU_DELETE_MULTIPLE" = "Delete %lu Items";
"PALETTE_MENU_PIN_MULTIPLE" = "Pin %lu Items";
"PALETTE_MENU_UNPIN_MULTIPLE" = "Unpin %lu Items";

/* Palette empty state */
"PALETTE_EMPTY_REFERENCE" = "No reference presets\n+ to add";
"PALETTE_EMPTY_LOCKED" = "No lock presets\n+ to add";

/* Palette overwrite confirmation */
"PALETTE_OVERWRITE_CONFIRM_TITLE" = "Confirm Overwrite";
"PALETTE_OVERWRITE_CONFIRM_MESSAGE" = "This will replace the preset content. This action cannot be undone.";
"PALETTE_OVERWRITE_CONFIRM_OK" = "Overwrite";

/* Grid view context menu */
"CONTEXT_MENU_SHOW_REFERENCE_INPUT" = "Show Reference Panel";
"CONTEXT_MENU_HIDE_REFERENCE_INPUT" = "Hide Reference Panel";
"CONTEXT_MENU_SHOW_LOCKED_PANEL" = "Show Locked Panel";
"CONTEXT_MENU_HIDE_LOCKED_PANEL" = "Hide Locked Panel";
"CONTEXT_MENU_SHOW_PRESETS" = "Show Presets Panel";
"CONTEXT_MENU_HIDE_PRESETS" = "Hide Presets Panel";
"CONTEXT_MENU_SHOW_TOOLBAR" = "Show Toolbar";
"CONTEXT_MENU_HIDE_TOOLBAR" = "Hide Toolbar";
"CONTEXT_MENU_LIGHT_MODE" = "Light Mode";
"CONTEXT_MENU_DARK_MODE" = "Dark Mode";
/* Grid lines (Issue #422) */
"CONTEXT_MENU_SHOW_GRID_LINES" = "Show Grid Lines";
"CONTEXT_MENU_HIDE_GRID_LINES" = "Hide Grid Lines";
"CONTEXT_MENU_GRID_STYLE" = "Grid Style";
"GRID_STYLE_FIELD" = "Cross Grid";
"GRID_STYLE_ASTERISK" = "Diagonal Grid";
"GRID_STYLE_HASH" = "Division Grid";
/* Grid toolbar button (Option+click: settings) */
"GRID_TOGGLE_SHOW_TOOLTIP" = "Show Grid (Option: Settings)";
"GRID_TOGGLE_HIDE_TOOLTIP" = "Hide Grid (Option: Settings)";
/* Counter Frame (Issue #435) */
"CONTEXT_MENU_SHOW_COUNTER_FRAME" = "Show Bounding Box";
"CONTEXT_MENU_HIDE_COUNTER_FRAME" = "Hide Bounding Box";
"CONTEXT_MENU_GRID_SETTINGS" = "Grid Settings…";
"GRID_STYLE_LABEL" = "Style";
"COUNTER_FRAME_LABEL" = "Bounding Box";

/* Grid view context menu - glyph operations */
"CONTEXT_MENU_INSERT_AT_CURSOR" = "Insert at Cursor";
"CONTEXT_MENU_OPEN_IN_NEW_TAB" = "Open in New Tab";

/* Import/Export menu */
"PRESETS_MENU_IMPORT" = "Import…";
"PRESETS_MENU_EXPORT_SELECTED" = "Export Selected…";
"PRESETS_MENU_EXPORT_ALL" = "Export All…";

/* Import mode dialog */
"PRESETS_IMPORT_MODE_TITLE" = "Import Presets";
"PRESETS_IMPORT_MODE_MESSAGE" = "Found %lu presets. How would you like to import them?";
"PRESETS_IMPORT_MODE_APPEND" = "Append";
"PRESETS_IMPORT_MODE_REPLACE" = "Replace All";

/* Import errors */
"PRESETS_IMPORT_ERROR_TITLE" = "Import Failed";
"PRESETS_IMPORT_ERROR_INVALID_FORMAT" = "The file format is invalid.";
"PRESETS_IMPORT_ERROR_UNSUPPORTED_VERSION" = "This file was created by a newer version. Please update the plugin.";
"PRESETS_IMPORT_ERROR_TYPE_MISMATCH" = "This file contains %@ presets, but you are on the %@ tab.";
"PRESETS_IMPORT_ERROR_EMPTY" = "No valid presets found in this file.";

/* Export errors */
"PRESETS_EXPORT_ERROR_TITLE" = "Export Failed";
"PRESETS_EXPORT_ERROR_MESSAGE" = "Could not save the file: %@";

/* Type names for error messages */
"PRESETS_TYPE_REFERENCE" = "reference";
"PRESETS_TYPE_LOCKED" = "locked";

/* Search field placeholder */
"SEARCH_PRESETS_PLACEHOLDER" = "Search presets…";
"SEARCH_NO_RESULTS" = "No results";

/* Sort options */
"SORT_NAME_AZ" = "Name A → Z";
"SORT_NAME_ZA" = "Name Z → A";
"SORT_DATE_NEWEST" = "Date Added (Newest)";
"SORT_DATE_OLDEST" = "Date Added (Oldest)";

/* Sort button tooltip */
"SORT_BUTTON_TOOLTIP" = "Sort Order";

/* About panel */
"ABOUT_MENU_ITEM" = "About NineBoxView Pro…";
"ABOUT_WINDOW_TITLE" = "About";
"ABOUT_LICENSED_TO" = "Licensed to:";
"ABOUT_LINK_WEBSITE" = "Website";
"ABOUT_LINK_HELP" = "User Guide";
"ABOUT_TRIAL_STATUS" = "Trial";
"ABOUT_TRIAL_EXPIRED" = "Trial Expired";
"ABOUT_STATUS_LICENSED" = "Licensed";
"ABOUT_STATUS_UNLICENSED" = "Unlicensed";

/* Deactivate license */
"ABOUT_DEACTIVATE_LICENSE" = "Deactivate License";
"ABOUT_DEACTIVATE_CONFIRM_TITLE" = "Deactivate License?";
"ABOUT_DEACTIVATE_CONFIRM_MESSAGE" = "Your license will be removed from this computer. You can reactivate it anytime with your license key.";
"ABOUT_DEACTIVATE_CONFIRM_OK" = "Deactivate";
"ABOUT_DEACTIVATE_CONFIRM_CANCEL" = "Cancel";
